#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке.

b = int(input('input side 1: '))
h = int(input('input side 2: '))
square = b*h/2
print(square)